{
  "company_name": "Notion",
  "domain": "notion.so",
  "is_public": false,
  "analyzed_at": "2026-02-21T11:38:07.490532",
  "transcripts": [],
  "job_postings": [
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Mid-Market ",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap. What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Drive executive level relationships Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 3-5 years of full cycle sales at a fast growing software company A track record of high achievement in current and previous roles hitting or exceeding quotas A phenomenally strong communicator Engaging and compelling presentation skills A positive and openness minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results Nice to Haves: You've been an early sales hire at a fast growing start up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of quarterly sales planning New logo acquisition sales experience Our customers come from all walks",
      "location": "New York, New York",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Enterprise Account Executive, San Francisco ",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Enterprise Account Executive with an entrepreneurial and building spirit to join our GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Enterprise Account Executive, you will play an important role in defining/iterating on our sales motions, providing customer feedback to help shape our roadmap, and generating revenue to grow our sales business. What You'll Achieve: Manage the full sales cycle for enterprise accounts, from lead generation and qualification through negotiation, closing, and renewals. Develop and execute strategic plans to meet new business targets and grow our customer base. Navigate complex organizations to identify and build relationships with executive sponsors and champions. Understand customers' business objectives to conduct effective discovery sessions and present tailored solutions. Create and deliver compelling presentations and product demonstrations to prospective clients. Negotiate contractual terms and pricing to secure win-win agreements. Collaborate with Solutions Engineering, Customer Success, Product, and Marketing teams to ensure customer success. Maintain detailed records of sales activities and pipeline in CRM tools. Foster strong relationships with key stakeholders, including C-suite executives, to drive positive ROI and long-term partnerships. Skills You'll Need to Bring: 6+ years of full-cycle sales experience, preferably at a fast-growing software company. Extensive experience in enterprise SaaS sales within the AMER region. Proven track record of achieving and exceeding sales targets. Extensive field-based enterprise software sales experience, selling solutions into large enterprise accounts. Proven ability to sell into C-Level and work with stakeholders across various lines of business. Experience in complex solution sales and consistently closing large figure deals. Exceptional communication and presentation skills. A builder mentality who thrives in collaborative environments. Self-motivated and able to manage tasks and projects independently. Ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity. You don’t need to be an ",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "SaaS",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Commercial",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap. What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Drive executive level relationships Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 1-3 years of full cycle sales at a fast growing software company A track record of high achievement in current and previous roles hitting or exceeding quotas A phenomenally strong communicator Engaging and compelling presentation skills A positive and openness minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results Nice to Haves: You've been an early sales hire at a fast growing start up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of quarterly sales planning New logo acquisition sales experience Our customers come from all walks",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Solutions Engineer, EMEA",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: The Notion sales organisation has a strong Product Led Growth lean, with many customers entering our funnel through our self-service motion before our product grows toward being a wall-to-wall solution. As we grow, more and more prospects are investigating how Notion can integrate with their existing tech stack, replace existing solutions, or be deployed in large or phased implementation to support desired business goals. As an early member of the Solutions Engineering team, you will: Partner with members of the sales org on customer engagements with prospective and existing customers Respond to advanced product and technical questions, RFPs, and security questionnaires in a precise and timely manner Provide thoughtful technical guidance to customers throughout the sales process, with a focus on quickly enabling customers to successfully deploy and integrate Notion Showcase custom solutions with Notion based on deep understanding of Notion’s ability to support customer workflows and integrated applications as part of the pre-sales process Curate structured product feedback to enable the Product and Engineering teams to enhance and refine Notion to solve customer needs Work with marketing to refine our technical narrative for the product, including blog posts, webinars, and customer-facing marketing collateral Educate the sales org on the product, upcoming releases, competitive analysis, and topical information about typical customer environments and third party applications Document technical considerations and contribute to internal knowledge bases as a resource for other teams, customers, and partners What You'll Achieve: Serve as the customer's technical advisor: You'll help customers craft Notion to serve their specific business needs and explore new workflows and use cases. Meaningfully shape our future product and messaging: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next. Help build the foundations of Solutions Engineering at Notion -  As an early member of our SE org and regional team, you'll be instrumental in helping define our sales-assisted motions. Join a fantastic team at a magical time: Notion has over three million users with a sma",
      "location": "Dublin, Ireland",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Mid-Market, DACH",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We're looking for a motivated Account Executive with an entrepreneurial and building spirit to join our founding sales team! As an early member of the team, you'll be instrumental in helping define our sales motion, meaningfully shape our future product, and drive business revenue all while having a blast doing it! What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Hunt and close new mid market logos within your territory Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world-class customer experience Skills You'll Need to Bring: 5+ years of full cycle sales at a fast-growing software company A track record of high achievement in current and previous roles hitting or exceeding quotas Fluency in both English and German Experience working with customers/users within the DACH market A phenomenally strong communicator Engaging and compelling presentation skills A positive and open-minded attitude A builders mentality who thrives in collaborative environments An ability to operate within the grey and find creative or out-of-the-box solutions when faced with ambiguity Nice to Haves: You've been an early sales hire at a fast-growing start-up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of quarterly sales planning New logo acquisition sales experience Our customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Notion. Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, colour, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental di",
      "location": "Dublin, Ireland",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Commercial",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap. What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Drive executive level relationships Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 1-3 years of full cycle sales at a fast growing software company A track record of high achievement in current and previous roles hitting or exceeding quotas A phenomenally strong communicator Engaging and compelling presentation skills A positive and openness minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results Nice to Haves: You've been an early sales hire at a fast growing start up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of quarterly sales planning New logo acquisition sales experience Our customers come from all walks",
      "location": "New York, New York",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Application Security Engineer",
      "department": "Security",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About the role: Millions of people use Notion — and this number is increasing every day. Our users depend on us to deliver a secure and trustworthy experience, and we value this more than anything. We want to keep building on that trust, while also continuing to amaze our users with the tools they can build in Notion. This is where you come in — to help us forge a strong, reliable path forward to the future. The Notion application is flexible, powerful and always evolving. With a product that needs to scale to meet the needs of many thousands of businesses globally. They rely on us to protect their data and that of their customers. Notion is looking for security engineers that have a passion for making it as easy as possible for developers to write secure code. As an Application Security Engineer you will be a consultant, advocate and builder that is hyper focused on preventing and eliminating software vulnerabilities across Notion's product suite. What You'll Achieve: As an early member of Notion’s Application Security team, you will have a large input in defining the direction and goals of the program. Make the secure path the easy path for product teams by providing design guidance and finding solutions that eliminate classes of vulnerabilities. Create static and dynamic analysis rules that detect weaknesses in our codebase. Provide developers guidance and education on security and privacy best practices that prevent the authoring of vulnerabilities. Participate in and drive mitigation strategies during AppSec related incident responses. Build and maintain tools that prevent vulnerabilities or automate remediation. Skills You'll Need to Bring: Security Architecture expertise: You have at least 3+ years of experience working with product teams to design and/or build secure software. Thoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck. Ability to advocate for and lead cross functional projects: You regularly advocate for security hardening projects that you then lead by partnered with product engineering teams to improve the sec",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Fullstack, Early Career",
      "department": "Engineering",
      "description": "About Us Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About the Role As an Early Career Software Engineer at Notion, you’ll help shape core user experiences and accelerate how people discover value in Notion. You'll tackle meaningful challenges with increasing autonomy, crafting code that millions of users will experience. You'll take ownership of projects that matter, make critical technical decisions, and contribute your unique perspective to our product vision. Working alongside passionate experts across design, product, and data, you'll help shape the future of how people work. We’re hiring early career engineers to join us across several teams at Notion. Your recruiter will partner with you to find the team that best aligns with your interests and where you can make the highest impact. What You’ll Achieve Plan, build, and ship product features from conception to launch, then iterate based on insights and user feedback. Improve performance, reliability, and quality of key experiences used by millions of users and thousands of organizations. Run experiments that drive activation, retention, collaboration, and revenue, partnering with design, data science, and research. Build internal tools and platform improvements that help all engineers ship quickly and safely. Contribute to team norms, code quality, and a culture of learning and thoughtful tradeoffs. Areas you might work on Core Notion product features: Help develop, improve, and maintain features for our flagship product, focusing on the editor, databases, sharing, or other key areas that power millions of workflows. AI and automation: Help develop and integrate intelligent features that make Notion more powerful, contextual, and efficient for our users. Growth and activation: Work on features that help new users discover Notion's value, improve onboarding experiences, and increase user engagement. Platform and infrastructure: Contribute to the systems that power Notion's backend services, ensuring reliability, scalability, and performance as our user base grows. Skills You’ll Bring Proven track record of execution: You have a minimum of 1 year (and up to 3 years) of full-time professional engineering experience, including building world-class product experiences as part of an engineering team. You have solid fundamentals in data structures",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Search Quality and Ranking",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a engineer to join our small but nimble Search team whose mission is to find the best documents users (or AI tools!) are looking for, as quickly as possible. As a Search Engineer, you will work on using state-of-the-art models to improve Notion search ranking. You’ll be exploring the boundaries of what’s possible with the latest and greatest Search technologies and finding innovative ways to apply new industry learnings to Notion. What You'll Achieve: You'll build and maintain our core search APIs, used heavily by internal teams, external users, and agents You will build new ranking models that bring meaningful quality improvements while keeping latency low (we care a lot about latency here!) You'll build out our core ML infra (we use Anyscale / Dynamo) You'll improve ranking across all sorts of different recall sources, like Elasticsearch and vector databases Skills You'll Need to Bring: You have experience in a technically challenging domain (latency sensitive systems; recommender systems; etc) and are energized by learning new technologies. Holistic Problem Solver: You approach problems holistically, starting with a clear and accurate understanding of the context. You think critically about the implications of what you're building and how it will impact real people's lives. You can navigate ambiguity flawlessly and decompose complex problems into clean solutions. Communicate with Care: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed. You are a lifelong learner and invest in both your own growth and the growth, learning, and development of your teammates. Impact Driven: You care about business impact and prioritize projects accordingly. You understand the balance between craft, speed, and the bottom line. You understand that reach comes with responsibility for our impact—good and bad. Work isn't a solo endeavor for you, and you enjoy collaborating cross-functionally to accomplish shared goals. You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results. Nice to Haves: 3+ y",
      "location": "New York, New York",
      "keywords": {
        "pivot": [
          "AI",
          "vector database"
        ],
        "tech_debt": [],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Mid-Market ",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap. What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Drive executive level relationships Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 4+ years of full cycle sales at a fast growing software company A track record of high achievement in current and previous roles hitting or exceeding quotas A phenomenally strong communicator Engaging and compelling presentation skills A positive and openness minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results. Nice to Haves: You've been an early sales hire at a fast growing start up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of quarterly sales planning New logo acquisition sales experience Our customers come from all walks",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Datastore",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Datastore infrastructure is the backbone of any software product, and at Notion, it plays a critical role in ensuring our millions of users have a fast, reliable, and secure experience. Our Datastore Infra Team builds and maintains the systems that power the databases and caches behind every Notion feature. From scaling our relational and NoSQL databases to designing data migration frameworks, we ensure that Notion’s data layer remains robust and future-proof. As part of the Datastore Infra Team, you’ll have a unique opportunity to shape how Notion manages and scales its foundational data services, enabling innovation across the company. This role is based out of our New York City or San Francisco office. What You'll Achieve: You will drive the evolution of our datastore infrastructure to meet the needs of over 100 million global users and support the rapid growth of our product and business. This includes ensuring our systems are reliable, efficient, and scalable, while evaluating and integrating new technologies to keep us ahead of emerging challenges. Your work will empower our engineers to build features with confidence, backed by a strong datastore foundation. You will design and deliver a Datastore Platform that simplifies how teams manage and interact with data at scale. From flexible schema management to migrating hundreds of billions of records, you’ll develop tools and frameworks that make it easier for engineers to innovate while maintaining safety, efficiency, and performance. You will develop the skills and confidence to debug live production systems with minimal disruption, whether replacing components or managing failovers. You will participate in an on-call rotation, responding to incidents to uphold service reliability and quickly restore normal operations. You will partner with product engineers and other infra teams to ensure our datastore infrastructure aligns with evolving business needs and product goals Skills You'll Need to Bring: Familiarity with Datastore Systems: You have experience with large scale relational databases, distributed caches, and NoSQL systems. You understand how to design, scale, and optimize them to support growing business needs. Our team utilizes cloud-based datastore solutions like",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "migration"
        ],
        "fiscal": [
          "efficiency"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Sales Manager, Asia",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life's work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are hiring our founding team and first Sales Leader for our new Singapore office. This person will help grow our business across Asia. They will build a world class culture and help establish this once-in-generation-company in the world's fastest growing region. We need someone with an entrepreneurial and builder spirit, someone who enjoys coaching sales reps to be the best they can be, someone who is data-driven and experienced in managing a high-velocity sales pipeline. As our first Sales Manager, you and your team will play an important role defining/iterating on our sales motions, providing customer feedback to help share our roadmap, and generating revenue to grow our sales business. You will own the strategy and execution of your team’s territory. What You'll Achieve: Lead a team of Account Executives who handles full cycle sales activities, including: prospecting/building pipeline, developing new potential accounts, expanding existing customers, and renewing an install base Own the strategy of your team’s territory, including how the team maximizes the revenue it is generating and retaining Own the execution of your team’s strategy, including the team forecast and pipeline generation Work with cross functional partners to build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Drive executive level relationships - internally and externally Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 8+ years of full cycle sales at a fast growing software company 5+ years of leading a sales organization at a fast growing software company Strong leader who builds cross functional relationships inside and outside of sales A track record of leading high performing teams who exceed their quotas A phenomenally strong communicator A strong ability to analyze data to build thoughtful strategies Engaging and compelling presentation skills A passion for coaching and rep development A positive and open minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An abil",
      "location": "Singapore",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Enterprise, Singapore ",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life's work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We're hiring our first sales person to help build our founding team in Singapore. You'll develop our sales strategy for Asia, focusing on large business customers in Singapore, Taiwan, and Hong Kong. You will represent Notion in the region, working to build strong connections with government and industry partners. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. You will play an important role in defining/iterating on our sales motions, providing customer feedback to help shape our roadmap, and generating revenue to grow our sales business. What You'll Achieve: Help launch a once-in-a-generation company in Asia. Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Manage the entire sales cycle from lead generation and pre-qualification to negotiation, closing, and renewing deals for strategic accounts across the region Build and maintain strong relationships with key stakeholders, including C-suite executives, to ensure customer satisfaction and long-term partnerships. Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Develop and execute strategic plans to achieve sales targets and expand our customer base Prepare and deliver compelling presentations and product demonstrations to prospective clients. Build and nurture key Government and industry body relationships. Maintain accurate records of all sales activities and pipeline management using CRM tools. Collaborate cross-functionally with internal teams, including Marketing, Product, and Customer Success, to deliver exceptional value to clients. Skills You'll Need to Bring: 5+ years of full-cycle sales experience, preferably at a fast-growing software company. Extensive experience in SaaS sales within the South East and North Asia markets. A builder mentality who thrives in collaborative environments. Proven track record of achieving and exceeding sales targets. Proven ability to sell into C-Level and work with stakeholders across various lines of business. Experience in complex solution sales and consistently closing large figure deals. Except",
      "location": "Singapore",
      "keywords": {
        "pivot": [
          "AI",
          "SaaS",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Enterprise Data Platform",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Join Notion’s Data Platform team as we scale our infrastructure for enterprise customers. You’ll help design and build the core data platform that powers Notion’s AI, analytics, and search while meeting stringent security, privacy, and compliance requirements. This role focuses on the data platform layer (storage, compute, pipelines, governance) and partners closely with Security, Search Platform, AI, and Data Engineering. What You'll Do: Design and evolve the data lakehouse Build and operate core lakehouse components (e.g., Iceberg/Hudi/Delta tables, catalogs, schema management) that serve as the source of truth for analytics, AI, and search. Own critical data pipelines and services Design, implement, and harden batch and streaming pipelines (Spark, Kafka, EMR, etc.) that move and transform data reliably across regions and cells. Advance EKM and encryption-by-design Work with Security and platform teams to integrate Enterprise Key Management (EKM) into data workflows, including file- and record-level encryption and safe key handling in Spark and storage systems. Improve data access, auditability, and residency Build primitives for fine-grained access control, auditing, and data residency so customers can see who accessed what, where, and under which guarantees. Drive reliability and observability Raise the operational bar for our data stack: improve on-call experience, debugging, and alerting for data jobs and services. Optimize large-scale performance and cost Tackle performance and cost challenges across Kafka, Spark, and storage for very large workspaces (20k+ users, multi-cell deployments), including cluster migrations and workload tuning. Enable ML and search workflows Build infrastructure to support training and inference pipelines, ranking workflows, and embedding infrastructure on top of the shared data platform. Shape the platform roadmap Contribute to design docs and evaluations that influence our long-term platform direction and vendor choices. Skills You'll Need: Experience: 5+ years building and operating data platforms or large-scale data infrastructure for SaaS or similar environments. Programming: Strong skills in at least one of Python, Java, or Scala; comfortable working with SQL for analytics and data modeli",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "data platform",
          "SaaS",
          "enterprise",
          "RAG"
        ],
        "tech_debt": [
          "migration",
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Developer Experience",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Millions of people use Notion — and this number is increasing every day. That means millions of people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion. The Developer Experience team is responsible for architecting, implementing, and scaling the tools and frameworks that Notion developers use to build Notion. We are looking for engineers who are passionate about solving engineering productivity challenges, have deep empathy for other developers, and love to communicate with engineers. You don't need to have experience in this domain but willing to advocate for developer experience is the key. What You'll Achieve: Collaborate with engineers across the company to deliver an industry-leading developer experience, along the way working deeply with tools like the TypeScript language server, lint tooling, and the Notion CLI to improve developers’ day to day experience. Work on the bleeding edge of tooling performance, researching and evaluating new tools and keeping up with new developments in the developer experience space in the JS ecosystem. Work deeply with GitHub and our CI systems to help ensure engineers can merge their code quickly and safely. We aim for all PR CI pipelines to finish within 15 minutes! Take ownership of our development environment and toolchain, and contribute to novel projects across the company to deliver impact. Skills You'll Need to Bring: A drive to make developers’ lives better: you have a strong interest in keeping engineers in their flow state through better tooling. You like to think critically about the workflows engineers use in their day to day work, finding bottlenecks and thinking outside of the box to find ways to pave a better golden path for engineers to follow. A focus on user experience: you bring care and craft to the user experience you build into your products. Your work emphasizes simplicity, supportability, and ease-of-use, and you communicate clearly with other teams and engineers to get feedback on where we can improve. Multitasker and present: you like interrupts especially if this is blocking engineers.You switch between y",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, AI Agentic Search, Early Career",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are seeking a software Engineer with at least 2-5 years of experience to work in the AI Connectors team. AI Connectors power AI agentic search, enabling customers to find answers across applications like Slack, Google Drive, Salesforce, and GitHub through Notion AI connectors . You'll build the end-to-end AI agentic search experience: Design and ship connectors from scratch, keeping third-party data continuously in sync. Build semantic search infrastructure powered by vector embeddings and efficient storage systems. Transform natural language questions into intelligent queries across multiple data sources. Implement ranking systems that surface the most relevant results while respecting user permissions and access controls. Scale to millions of documents across thousands of customers. You're a builder who thrives in fast-paced environments with a track record of shipping frequently. You have a strong foundation in distributed systems and data pipelines, with exposure to databases and production infrastructure. You write clean, maintainable code and are eager to take ownership of tasks with guidance. You make thoughtful technical decisions, ask the right questions when things are ambiguous, and learn quickly. You collaborate well with teammates and contribute to projects that power intelligent, agent-driven search experiences at scale. What You'll Achieve: You’ll work with a team of engineers and cross-functional partners across product, design, data science, and user research to define a product strategy and drive execution through conception, research, implementation, and maintenance. You’ll build and maintain foundational pieces of Notion’s building blocks, enabling a wide array of use cases in Notion such as docs, wikis, issue tracking, project management, and more. You’ll contribute to the overall performance, reliability, and robustness of the Notion product, ensuring it scales elegantly across many dimensions. You’ll partner with engineering leaders to identify and execute against high leverage technical investment that ensure the long-term flexibility and sustainability of our core systems. Skills You'll Need to Bring: Proven track record of execution: You have at least 2 years of fullstack engineering experience, inc",
      "location": "Hyderabad, India",
      "keywords": {
        "pivot": [
          "AI",
          "RAG",
          "agentic"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive, Enterprise, UK",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organisations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive - Enterprise UK with an entrepreneurial and building spirit to join our GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive - Enterprise UK, you will play an important role in defining/iterating on our sales motions, providing customer feedback to help shape our roadmap, and generating revenue to grow our sales business. This role is based in London. What You'll Achieve: Manage the entire sales cycle from lead generation and pre-qualification to negotiation, closing, and renewing deals for strategic accounts in the UK region. Develop and execute strategic plans to achieve sales targets and expand our customer base. Conduct comprehensive discovery sessions to understand client needs and present tailored solutions. Prepare and deliver compelling presentations and product demonstrations to prospective clients. Negotiate contract terms and pricing structures to secure profitable deals. Maintain accurate records of all sales activities and pipeline management using CRM tools. Build and maintain strong relationships with key stakeholders, including C-suite executives, to ensure customer satisfaction and long-term partnerships. Collaborate cross-functionally with internal teams, including Marketing, Product, and Customer Success, to deliver exceptional value to clients. Skills You'll Need to Bring: 8+ years of full-cycle sales experience, preferably at a fast-growing software company. Extensive experience in enterprise SaaS sales within the UK region. Proven track record of achieving and exceeding sales targets. Extensive field-based enterprise software sales experience, selling solutions into large enterprise accounts. Proven ability to sell into C-Level and work with stakeholders across various lines of business. Experience in complex solution sales and consistently closing large figure deals. Exceptional communication and presentation skills A builder mentality who thrives in collaborative environments. Self-motivated and able to manage tasks and projects independently. Ability to operate within the grey and find creative or out-of-the-box solutions when faced with ambiguity. Nice to Ha",
      "location": "London, United Kingdom",
      "keywords": {
        "pivot": [
          "AI",
          "SaaS",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": [
          "profitable"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Manager, Mid-Market Sales",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Notion is transitioning from ‘start-up’ to ‘scale-up’. The AMER region currently accounts for a significant portion of our user base and global revenues. We are looking for an exceptional Sales leader to help scale us to the next level. Given the strong subscription and usage based revenue model, building out our sales program is a vital part of our long term growth strategy. The AMER sales team is responsible for landing new logos into our business products and generating net new ARR for Notion from customers in the AMER region. The team manages a mixture of lead generation channels across Inbound and Greenfield motions as well as working with our self-service install base to drive upgrades into our Enterprise products. What You'll Achieve: As the Manager, Mid-Market Sales you will work directly with the AMER New Business Sales Leader in creating a strategy to develop net new revenue in the Mid-Market segment for Notions business products in the AMER region. Partnering with regional leaders across Sales Strategy, Marketing and Sales Development teams to plan territory mapping and pipeline development programs. Partner with the Customer Success and Solutions Engineering teams to onboard new customers and honing our customer journey to set new customers up for longer term success with Notion. You will recruit, develop and lead a team of new business Account Executives, overseeing day-to-day activity while setting clear expectations and managing performance goals. You understand the importance of communication and collaboration in defining a customer-first mentality , and you will work closely with our Product, Marketing and Commercial leadership teams to drive insight in to Ideal Customer Profile. Help build the foundations of Sales at Notion: As an early member of our sales org, you'll be instrumental in helping define our sales assisted motions. Join a fantastic team at a magical time: We've got tens of millions of users with a small team, which gives us a huge green field to work with. You'll join at the perfect time to shape how we grow from here. Meaningfully shape our future product: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next. Elevate yo",
      "location": "New York, New York",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Product Marketing Manager, IT Solutions",
      "department": "Marketing",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We’re hiring a Product Marketing Manager, IT Solutions to own positioning, enablement, and go-to-market for IT buyers and admin audiences. You’ll partner deeply with Product on enterprise launches (analytics, security, permissions, migrations), translate Voice of Customer into roadmap priorities, build strategic narratives for CIOs and Digital Transformation leaders, and drive demand gen campaigns + sales programs that target IT decision-makers. What You'll Achieve: Develop strategic narratives and executive positioning for CIOs, Digital Transformation leaders, and IT/Ops stakeholders. Partner closely with Product on enterprise feature launches and enablement (analytics, security, permissions, migration, etc.) and our enterprise plan. Support inbound product strategy by synthesizing Voice of Customer and market insights Build and execute integrated GTM campaigns targeting IT/Ops buyers (demand gen programs, sales materials, and demos) with clear metrics on pipeline generation and closed/won rates. Own ongoing admin communications, in partnership with CSM, to drive engagement, adoption, and expansion. Create external thought leadership and narratives on workspace architecture, ideal setup frameworks, AI maturity models, and enterprise transformation. Responsibilities Own positioning and messaging for IT and admin audiences, ensuring it ladders up to a cohesive enterprise story. Partner with Product on launches, beta programs, and roadmap prioritization; translate customer needs into product requirements. Produce high‑impact content: first‑call decks, solution briefs, case studies, executive one‑pagers, discovery guides, proof kits, and admin playbooks. Enable GTM teams through trainings, office hours, and deal support; drive adoption of content and tools. Lead market research and customer insight programs to inform messaging, roadmap, and segmentation strategy. Run campaigns and moments in market tied to launches, announcements, and category conversations—tracked via pipeline generation and win rates. Establish measurement plans to track program effectiveness and continuously iterate. Skills You'll Need to Bring: 6+ years in B2B product or solutions marketing with ownership across positioning, enablement, and go-to-market progra",
      "location": "New York, New York",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise"
        ],
        "tech_debt": [
          "migration",
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Enterprise Customer Success Manager, AMER",
      "department": "Customer Success",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Drive growth, adoption, retention, and expansion for a product people love that solves real problems : Fortune 500 companies use Notion to run huge teams — but your friends and family can also use it to take notes, display photos, and more. Help customers achieve real results through AI-powered workflows: You'll partner with customers to identify their goals, then guide them through hands-on training and working sessions to build workflows that solve their specific problems—with AI at the center. Own renewal execution grounded in proven value and outcomes : As customer value becomes increasingly tied to workflow adoption and business results, lead renewals by translating demonstrated outcomes into renewal readiness. Help build the foundations of Customer Success at Notion: As an early member of our Enterprise team, you'll be instrumental in helping define, refine, and scale our motion. Meaningfully shape our future product: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next. Elevate your skills as we tackle our most impactful challenges : We've achieved more than teams 10x our size in less time — and there's so much more to do and learn. What You'll Achieve: Drive AI adoption, value delivery, and renewals for a book of named accounts. Shape customer outcomes, strengthen partnerships, and contribute directly to predictable revenue. Lead AI workshops to build and deploy workflows that solve specific business problems. Identify and qualify expansion opportunities within existing accounts. Co-build customer success plans to help every customer achieve desired objectives. Partner with AEs on growth strategy while owning customer activation and renewal readiness. Learn our product inside and out and help your customers drive business outcomes. Innovate and iterate on Customer Success programs to retain and grow customers while mitigating churn or contraction. Document and share key findings/learnings with the broader Notion organization. Skills You'll Need to Bring: 7+ years of success in your current Customer Success or Account Management role You have experience driving the end-to-end customer journey - from adoption to renewal Strong discovery skills to ",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise"
        ],
        "tech_debt": [],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Mid-Market Customer Success Manager",
      "department": "Customer Success",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Drive growth, adoption, retention, and expansion for a product people love that solves real problems : Fortune 500 companies use Notion to run huge teams — but your friends and family can also use it to take notes, display photos, and more. Help customers achieve real results through AI-powered workflows: You'll partner with customers to identify their goals, then guide them through hands-on training and working sessions to build workflows that solve their specific problems—with AI at the center. Own renewal execution grounded in proven value and outcomes : As customer value becomes increasingly tied to workflow adoption and business results, lead renewals by translating demonstrated outcomes into renewal readiness. Help build the foundations of Customer Success at Notion: As an early member of our Enterprise team, you'll be instrumental in helping define, refine, and scale our motion. Meaningfully shape our future product: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next. Elevate your skills as we tackle our most impactful challenges : We've achieved more than teams 10x our size in less time — and there's so much more to do and learn. What You'll Achieve: rive AI adoption, value delivery, and renewals for a book of named accounts. Shape customer outcomes, strengthen partnerships, and contribute directly to predictable revenue. Lead AI workshops to build and deploy workflows that solve specific business problems. Identify and qualify expansion opportunities within existing accounts. Co-build customer success plans to help every customer achieve desired objectives. Partner with AEs on growth strategy while owning customer activation and renewal readiness. Learn our product inside and out and help your customers drive business outcomes. Innovate and iterate on Customer Success programs to retain and grow customers while mitigating churn or contraction. Document and share key findings/learnings with the broader Notion organization. Skills You'll Need to Bring: 5+ years of success in your current Customer Success or Account Management role You have experience driving the end-to-end customer journey - from adoption to renewal Strong discovery skills to ",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise"
        ],
        "tech_debt": [],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer, Cloud Infrastructure",
      "department": "Engineering",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Millions of people use Notion — and this number is increasing every day. That means millions of people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion. The Cloud Infrastructure team is a unique opportunity within Notion to architect the foundational cloud environment that can scale alongside Notion’s rapid growth. As an engineer on the team, you'll work on the fundamental infrastructure components that all other teams at Notion build upon and guide Notion through the next few years of growth. What You'll Achieve: Drive the future of Cloud Infrastructure at Notion —you’ll lead our strategy and execution across compute, networking, and resource orchestration, ensuring our platform scales reliably and securely to serve 100M+ users worldwide. Including container orchestration, cloud cost efficiency, resilience, global expansion across regions while considering compliance and performance. Hands on in building our next-generation self-service platform , partnering with product engineers to enable rapid, reliable deployment with strong guardrails—while reducing friction and increasing velocity across hundreds of developers. You'll be responsible for maintaining a high-quality bar for everything your team ships. Lead by example in operational excellence —you’ll guide the team through high-severity incidents, eliminate our gaps in observability, improve incident response processes, and uphold reliability standards. You’ll participate in a sustainable on-call rotation and help shape Notion’s reliability culture. Skills You'll Need to Bring: Software Engineer with Cloud Infrastructure Foundation: You are a hands-on software engineer who is an expert in contributing to large codebases and establishing strong patterns in greenfield projects. You bring a test-driven development mindset, carefully consider how your changes will affect production environments, and take steps to validate them. You have expertise with cloud concepts, particularly in networking, compute optimization. You build observability tools to validate changes and programmatically catch regressions. Startup mental",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": [
          "efficiency",
          "optimization"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Head of Business Partnership Finance",
      "department": "Finance",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: Lead a high-performing Business Partnership (BP) Finance team delivering strategic partnership and financial leadership to business units. Act as the primary finance liaison to department heads and senior leadership, guiding planning, forecasting, and decision-making. Transform financial data into actionable insights that influence go‑to‑market strategies, investment decisions, and profitability improvements. We are a lean team, so your impact will be felt immediately. What You'll Achieve: Provide finance support across GTM, R&D, and G&A expense and headcount management. Lead coordination & improvements of monthly Budget vs Actuals (BvA) reviews and other opportunities to build financial maturity. Elevate finance's strategic voice through a collaborative mindset. Drive improved forecast accuracy, alignment, and collaborative strategic decision making as a part of ad hoc and recurring finance processes including monthly close, reforecasts, planning, long-range planning, and other critical Expense & Headcount forecasting processes and reporting. Support our monthly close and forecast processes - analyze financial results, distill and synthesize key trends, and communicate risks & opportunities to influence business outcomes. Assist in preparation of monthly & quarterly management reporting including Budget vs Actuals analyses and dashboards. Drive deeper Budget vs Actuals understanding and forecast precision via smarter, more data-driven modeling and tighter cross-functional partnership, particularly in uncharted, high impact areas. Tackle new & evolving priorities for the team. Conduct ad hoc modeling (e.g. pricing, cost-benefit, investment cases). Translate data into narratives that guide leadership decisions. Strengthen our operational infrastructure by identifying process improvements. Build automation to take steps out of our recurring motions and reduce margin of error. Coach and mentor talented existed team to develop both technical and partnership capabilities. Grow the team as part of our operational excellence journey. Skills You'll Need to Bring: ~10-15 years experience in Business Partnership FP&A and other finance roles Proven leadership managing business partnership FP&A teams and executive relationships Ability to ",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": [
          "headcount",
          "lean",
          "budget"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive - Mid Market, Japan",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life's work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap. What You'll Achieve: Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals Drive executive level relationships Run product demos to close business at or above quota level Help build playbooks and define our sales motion Liaise with our incredible user base to provide world class customer experience Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal) Skills You'll Need to Bring: 5+ years of relevant experience including full cycle sales at a fast growing IT company A track record of high achievement in current and previous roles hitting or exceeding quotas A phenomenally strong communicator Engaging and compelling presentation skills A positive and openness minded attitude A strong desire to be successful without sacrificing your values A builder mentality who thrives in collaborative environments An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity Grit and tenacity to achieve your goals and contribute to our mission You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results. Nice to Haves: You've been an early sales hire at a fast growing start up before You've got strong technical chops Direct sales plus experience of selling through Partners Experience of qu",
      "location": "Tokyo, Japan ",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Account Executive - Enterprise, Japan",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life's work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We're looking for a motivated Account Executive - Enterprise with an entrepreneurial and building spirit to join our founding sales team! As an early member of the team, you'll be instrumental in helping define our sales motion, meaningfully shape our future product, and drive business revenue all while having a blast doing it! What You'll Achieve: Manage the entire sales cycle from lead generation and pre-qualification to negotiation, closing, and renewing deals for strategic and enterprise accounts Develop and execute strategic account plans to achieve sales targets and expand our customer base. Conduct comprehensive discovery sessions to understand client needs and present tailored solutions. Prepare and deliver compelling presentations and product demonstrations to prospective clients by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Negotiate contract terms and pricing structures to secure profitable deals. Build and maintain strong relationships with key stakeholders, including C-suite executives, to ensure customer satisfaction and long-term partnerships. Collaborate cross-functionally with internal teams, including Marketing, Product, and Customer Success, to deliver exceptional value to clients. Maintain accurate records of all sales activities and pipeline management using CRM tools to report forecasting accurately to report line Skills You'll Need to Bring: 8+ years of relevant experience including full cycle sales at a fast growing IT company. Extensive experience in enterprise SaaS sales in Japan region. Proven track record of achieving and exceeding sales targets. Extensive field-based enterprise software sales experience, selling solutions into large enterprise accounts. Proven ability to sell into C-Level and work with stakeholders across various lines of business. Experience in complex solution sales and consistently closing large figure deals. Exceptional communication and presentation skills in both Japanese and English. A builder mentality who thrives in collaborative environments. Self-motivated and able to manage tasks and projects independently. Ability to operate within the gray and find creative or out-of-the-box solutions when faced",
      "location": "Tokyo, Japan ",
      "keywords": {
        "pivot": [
          "AI",
          "SaaS",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": [
          "profitable"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Sales Development Representative, Japan",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life's work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: We're looking for a motivated Sales Development Representative with an entrepreneurial and building spirit to join our founding sales team! As an early member of the team, you'll be instrumental in helping define our sales motion, meaningfully shape our future product, and drive business revenue all while having a blast doing it! What You'll Achieve: Handle inbound requests from prospective customers interested in buying Notion Organize and take thorough notes on prospects. Qualify those prospects to determine whether or not they’re a good fit for Notion Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion Experiment on outbound activity to decision makers with customized messaging and channels to generate Enterprise opportunities Reach out to prospects via email, phone, and LinkedIn to educate them on our product/service Hold meetings with prospective customers to understand their business challenges and goals Help build playbooks and define our sales motion Hold ownership over pipeline generation tactics and strategic approaches Learn about our product inside and out and be able to give demos customized to the needs of different personas Collaborate and influence on performance initiatives, product launches and service innovation when working with cross-functional partners Work with our Global and Regional Marketing team to build strong program feedback loops Work with our Global GTM team to hit revenue & pipeline generation targets Skills You'll Need to Bring: You have minimum 2 years experience in sales or sales development in SaaS tech or a high growth environment Experience making cold calls to decision makers A track record of high achievement in current and previous roles, hitting or exceeding quotas Engaging and compelling customer skills - high cognitive empathy and ability to craft stories tailored to the customer You LOVE talking to customers; Always interested in digging deeper and learning more about their needs Fluency in Japanese and ideally business level English You don’t need to be an AI expert, but you’re curious and willing to adopt AI tools to work smarter and deliver better results. Nice to Have",
      "location": "Tokyo, Japan ",
      "keywords": {
        "pivot": [
          "AI",
          "SaaS",
          "enterprise"
        ],
        "tech_debt": [
          "pipeline"
        ],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Solutions Engineer, Tokyo",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: The Notion sales organization has a strong Product Led Growth lean, with many customers entering our funnel through our self-service motion before our product grows toward being a wall-to-wall solution. As we grow, more and more prospects are investigating how Notion can integrate with their existing tech stack, replace existing solutions, or be deployed in large or phased implementation to support desired business goals. As an early member of the Solutions Engineering team, you will: Partner with members of the sales org on customer engagements with prospective and existing customers Respond to advanced product and technical questions, RFPs, and security questionnaires in a precise and timely manner Provide thoughtful technical guidance to customers throughout the sales process, with a focus on quickly enabling customers to successfully deploy and integrate Notion Showcase custom solutions with Notion based on deep understanding of Notion’s ability to support customer workflows and integrated applications as part of the pre-sales process Curate structured product feedback to enable the Product and Engineering teams to enhance and refine Notion to solve customer needs Work with marketing to refine our technical narrative for the product, including blog posts, webinars, and customer-facing marketing collateral Educate the sales org on the product, upcoming releases, competitive analysis, and topical information about typical customer environments and third party applications Document technical considerations and contribute to internal knowledge bases as a resource for other teams, customers, and partners What You'll Achieve: Serve as the customer's technical advisor : You'll help customers craft Notion to serve their specific business needs and explore new workflows and use cases. Meaningfully shape our future product and messaging: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next. Help build the foundations of Solutions Engineering at Notion - As an early member of our SE org and regional team, you'll be instrumental in helping define our sales-assisted motions. Join a fantastic team at a magical time: Notion has over three million users with a small team, wh",
      "location": "Tokyo, Japan ",
      "keywords": {
        "pivot": [
          "AI"
        ],
        "tech_debt": [],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Software Engineer Intern (Summer 2026)",
      "department": "University",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. This internship will take place from May - September (based on your summer schedule) and you will need to be able to work out of our NY or SF office during this time. About The Role: Millions of people use Notion — and this number is increasing every day. That means a million people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion. This is where you come in. During your 12-week internship, you will be paired with a mentor that will help guide you as you work closely with our team to build and ship impactful projects. These projects will drive valuable impact to our customers and engineers. From product engineering, mobile, to infrastructure and security, we have opportunities available on different teams. Take a look at what our past intern cohort worked on with our Blog post here and here and TikTok post. What You'll Achieve: Write clean, secure, tested, and documented code. Design & enhance the Notion platform with new capabilities, as and when the need arises. Design, develop, and own new product functionality and/or infrastructure leveraging modern frameworks and tooling. Develop, fix and debug software for web services, databases, applications, tools, networks. Qualifications: Pursuing a bachelor's or master’s degree in computer science, engineering, or another related field. Must graduate before July 2027. Previous internship experience. Working towards a proficiency of one or more programming languages such as Typescript, Node.js, Go, Python, Java, Swift, Rust, or Kotlin. You find large challenges exciting and enjoy discovering problems as much as solving them. You are able to problem-solve and adapt to changing priorities in a fast-paced, dynamic environment. This internship will take place from May - September (based on your summer schedule) and you will need to be able to work out of our NY or SF office during this time. Skills You’ll Need To Bring: Thoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfor",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "RAG"
        ],
        "tech_debt": [],
        "fiscal": [
          "lean"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Technical Architect",
      "department": "Sales",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. . In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About The Role: As a Forward Deployed Engineer within Go-To-Market, you will lead complex customer engineering engagements from end to end, spanning large-scale migrations, integrating Notion with third party systems and tools, and production AI/agentic deployments. You’ll embed with enterprise customers to design and build solutions that integrate Notion deeply into their technical and operational environments. This includes writing and maintaining custom code, designing and deploying production-grade custom agents and AI workflows with MCP, Agent APIs, and Notion’s automation and execution infrastructure, building data pipelines, and resolving complex challenges around scale, permissions, and governance. Your work as a customer-facing engineer will help shape best practices for how we support complex customer needs and ensure Notion’s platform is ready for scale. What You'll Achieve: Own the hands-on technical delivery of customer engagements, including deep technical discovery, requirements gathering, solution design, and end to end implementation. Act as a trusted technical advisor, helping customers make informed architectural decisions and identify opportunities to expand and deepen their use of Notion. Design, build, and operate custom agents, integrations, automations, and data pipelines that connect Notion with customers’ systems and workflows. Lead the design and execution of large-scale content and data migrations, including discovery, scoping, data modeling, transformation logic, validation, and post-migration optimization. Work closely with client stakeholders to gather business and technical requirements and translate them into well-architected solutions that maximize the value of the Notion platform within their broader technical ecosystem. Design and build customer integrations, automations, and custom tooling as a part of Notion implementations. Design and operate feedback loops with Product, CX, and Engineering, translating real-world implementation challenges into actionable insights, technical requirements, and tooling improvements that directly influence Notion’s Product Roadmap and our Customers Build foundational discovery frameworks, technical standards, and internal tooling that define how Services delivers complex m",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise",
          "agentic"
        ],
        "tech_debt": [
          "migration",
          "pipeline"
        ],
        "fiscal": [
          "optimization"
        ]
      },
      "posted_date": "",
      "source": "ashby"
    },
    {
      "company_name": "Notion",
      "role_title": "Enterprise Product Marketing, GTM",
      "department": "Marketing",
      "description": "About Us: Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money. In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays, Tuesdays, and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays. About the Role: We’re hiring an Enterprise Product Marketing, GTM lead to own sales enablement, competitive intelligence, and ROI strategy for Notion’s enterprise business. You’ll build the single source of truth for how we win, quantify our value, and enable our go‑to‑market teams with the insights and assets to close and expand deals. Your scope includes competitive intelligence and campaigns, battle cards, ROI calculators and business value frameworks, Win/Loss insights, change management and maturity models for enterprises, AI value articulation for B2B buyers, and industry trends enablement. What You'll Achieve: Stand up and own Notion's competitor hub as a trusted, always‑current resource for sellers, CSMs, and leaders; translate insights into integrated competitive campaigns. Build and maintain best‑in‑class battle cards and competitive talk tracks for priority rivals, continuously refreshed with product, pricing, and positioning changes. Create accredited \"ROI of Notion\" reports, calculators, TCO comparisons, and re-purposable ROI statistics that quantify Notion's business impact for executives and buying committees. Establish a formal, ongoing Win/Loss program to surface patterns, improve messaging, and inform roadmap and pricing decisions. Develop clear AI value propositions and proof points tailored for B2B audiences and enterprise buying committees. Build Notion's change management story and enterprise maturity model to help customers navigate transformation. Design and run regular \"Industry Trends\" learning sessions for Sales to sharpen market and category fluency. From there, flex to the highest‑leverage surfaces—whether revisiting segmentation strategy or pursuing deeper enterprise buyer insights. Responsibilities: Own the competitive intelligence engine: research plan, sources, distillation, distribution cadence, and governance of the competitor hub. Develop competitive positioning and messaging, drive sales enablement, and build resources including battle cards, deep dives, and objection handling guides. Produce high‑impact assets: battle cards, first‑call guides, objection handling, proof points, ROI/TCO calculators, executive summaries, and change management frameworks. Create and maintain accredited ROI assets including cal",
      "location": "San Francisco, California",
      "keywords": {
        "pivot": [
          "AI",
          "enterprise",
          "RAG"
        ],
        "tech_debt": [],
        "fiscal": []
      },
      "posted_date": "",
      "source": "ashby"
    }
  ],
  "hiring_signals": {
    "pivot_keywords": [
      "SaaS",
      "vector database",
      "data platform",
      "AI",
      "RAG",
      "enterprise",
      "agentic"
    ],
    "tech_debt_keywords": [
      "pipeline",
      "migration"
    ],
    "fiscal_keywords": [
      "lean",
      "headcount",
      "profitable",
      "efficiency",
      "optimization",
      "budget"
    ],
    "total_jobs": 30,
    "departments": {
      "Sales": 16,
      "Engineering": 7,
      "Marketing": 2,
      "Customer Success": 2,
      "Security": 1,
      "Finance": 1,
      "University": 1
    },
    "engineering_ratio": 0.23
  },
  "tech_stack": {
    "company_name": "Notion",
    "domain": "notion.so",
    "frameworks": [
      "Next.js",
      "React",
      "Google Analytics",
      "Amplitude",
      "AWS CloudFront",
      "Vercel"
    ],
    "languages": [],
    "raw_headers": {
      "server": "cloudflare",
      "x-powered-by": "next.js",
      "content-type": "text/html; charset=utf-8"
    },
    "debt_signals": {
      "detected_legacy_tech": [],
      "legacy_score": 0.0,
      "assessment": "Low — modern stack detected"
    }
  },
  "github": {
    "company_name": "Notion",
    "org_name": "makenotion",
    "total_repos": 20,
    "total_open_issues": 194,
    "avg_commit_freq": 0.0,
    "languages": [
      "JavaScript",
      "TypeScript",
      "Python",
      "HTML",
      "PHP",
      "C#",
      "Go",
      "Shell",
      "Perl",
      "Makefile"
    ],
    "legacy_signals": [],
    "github_debt": {
      "score": 1,
      "label": "Minimal"
    },
    "top_repos": [
      {
        "name": "claude-code-notion-plugin",
        "open_issues": 4,
        "stars": 177,
        "days_since_update": 0,
        "language": null
      },
      {
        "name": "notion-mcp-server",
        "open_issues": 108,
        "stars": 3908,
        "days_since_update": 0,
        "language": "TypeScript"
      },
      {
        "name": "notion-sdk-js",
        "open_issues": 62,
        "stars": 5523,
        "days_since_update": 0,
        "language": "TypeScript"
      },
      {
        "name": "workers-template",
        "open_issues": 0,
        "stars": 3,
        "days_since_update": 0,
        "language": "TypeScript"
      },
      {
        "name": "cursor-notion-plugin",
        "open_issues": 0,
        "stars": 4,
        "days_since_update": 0,
        "language": null
      },
      {
        "name": "lsp-mcp",
        "open_issues": 0,
        "stars": 11,
        "days_since_update": 1,
        "language": "TypeScript"
      },
      {
        "name": "snowflake-mcp",
        "open_issues": 0,
        "stars": 1,
        "days_since_update": 3,
        "language": "Python"
      },
      {
        "name": "notion-agents-sdk-js",
        "open_issues": 5,
        "stars": 1,
        "days_since_update": 3,
        "language": "TypeScript"
      },
      {
        "name": "notion-cookbook",
        "open_issues": 3,
        "stars": 61,
        "days_since_update": 3,
        "language": "Shell"
      },
      {
        "name": "memcache",
        "open_issues": 2,
        "stars": 2,
        "days_since_update": 3,
        "language": "TypeScript"
      }
    ]
  },
  "financials": [],
  "layoffs": [],
  "funding": [
    {
      "company_name": "Notion",
      "round_type": "IPO",
      "amount_usd": 11000000000.0,
      "date": "Mon, 15 Dec 2025 08:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPdmNBY1Z3MHQ2SENtd3lUNEZnZ0RXZnlMSnlvZDA3TjBGZnQxMDVRWTdxamxZeW1LZE1SOThZRmNhY2JNdmU1aXVmUTU2eDZZdUt4NWNVNmlROHdnZHo1bk04bk8tWUduLU9Fd0M3eUxnX28tclFVU0pxU016M2ZGLTI0QTZhdFFHSUlpRVVtZHZLSG9qZkVB?oc=5",
      "headline": "Notion at $11 Billion: The Art of Growing Into Your Valuation — And After 14 Years, Into One Of The Next Great B2B IPOs - SaaStr"
    },
    {
      "company_name": "Notion",
      "round_type": "Growth",
      "amount_usd": 11000000000.0,
      "date": "Mon, 15 Dec 2025 08:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNc09ibGROYmppa3pYQmYwejlHSm56M2JUZE03RW9wenlHNW1oQkVNX2tGWEx6bGF3Y0xhOGtLTE91cjVyQ2EzZ1VtcVlOS0FZZGhqc2hVdDctam5QamlXejNQU0xJME90X3lSOVVNaHBrLXZSSk43UVVTUC05S3Z3S3UtbnFtTENOMFowZGtuODhRYjIyQWxmdTh3NVhSRDhHWVJVWG1va0R4VTdsVmwxaGlHODZKWVdrU0NqWk54SmlmWHZIZmxQdUw1akVicnRmb2dNZkd3?oc=5",
      "headline": "Notion Kicks Off Employee Share Sale At $11 Billion Valuation As AI Accelerates Its Growth - Forbes"
    },
    {
      "company_name": "Notion",
      "round_type": "Tender Offer",
      "amount_usd": 12000000000.0,
      "date": "Tue, 02 Dec 2025 08:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOVlhpcllFSS1KdkNWNjhydEFzVW5pd0VpUXhxSGF3S0pXcVpLRmVYdnJ3NXZRQXdoSWMycjJLWkpVSk5OLW9NV0YwUFRpSUpzc1VQTERRZ2MtUVhwaXR1dW5VREFFbEZCNFZ5bVpGNjdDY3VDYl94LThlVWhldmdMaW9aLTdxb3JFUEhVWjl1OWpwOGk1OE05RjUtMEd2UWJOcjg5V3dJV0pVVkRZd09adQ?oc=5",
      "headline": "Notion Is Said to Weigh Tender Offer at $12 Billion Valuation - Bloomberg.com"
    },
    {
      "company_name": "Notion",
      "round_type": "Tender Offer",
      "amount_usd": 270000000.0,
      "date": "Wed, 28 Jan 2026 18:03:51 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOZ3dIS3YxNS0tQ1pVTDZnNmF2VW5LVTltckJkdnp6WE1uaGRmT2U3a09XM3djVkpLYVFQRGlrNFZTZ3lFXzQybWpIU3N6WEJKbVJXOUkyYmJkZno4ZlFSdmpWczJISEVPdnJqUDF5QzVjeUJxTW5TVFhmbTg2RkZFNzd2TFkyQ2FLTnZ1ZF9hMXAyRERsTmNaZFQ3V0FETGMtaWtvMkJFR21nNjYxMGhtdVVTWGtRN0hNRVpGMg?oc=5",
      "headline": "Notion conducts $270 million tender offer at $11 billion valuation - SecondaryLink"
    },
    {
      "company_name": "Notion",
      "round_type": "Unknown",
      "amount_usd": 270000000.0,
      "date": "Tue, 27 Jan 2026 08:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOR3AtNmlNUHhDQm1DVmM0WURuNXlpbWwtQzVpNVRfVXpXeDZ1NU9MYWQ2bEZ4eEZqRGFfU0ZZLXEzX3Uxazd4REpzaVJXYWdScVhCQlZSaHk4c05yS09xSHVFa3pnS2JrRTk5aXFjT3RvcERIZFlRZ3pCd2JmMzdDUE9nZGNBX1A0T3ZVbjk5ZHl4Yk0t?oc=5",
      "headline": "Notion completes $270m employee share sale at $11b valuation - Tech in Asia"
    },
    {
      "company_name": "Notion",
      "round_type": "Unknown",
      "amount_usd": 270000000.0,
      "date": "Tue, 10 Feb 2026 08:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQY3JjMldkYUxBUk1OSzRNemdSZ0piV1VZTW8zVG1UV0otVTh2RUdZb0g3cUU0QUh4OWIwZVdwNklpeVhsMm5WSTBMUWhRUjZrUGFaeHFZMUc4U0JDdHVlOE50TFIyd2lzSkE0ODl4dWJXU3BoaUlkU1o5TGk3SkJseHI2MFVFMVJlZXNwd0pWbExkTkw1eFdISA?oc=5",
      "headline": "GIC Invests $270 Million in Notion Through Employee Share Sale - Technobezz"
    },
    {
      "company_name": "Notion",
      "round_type": "Unknown",
      "amount_usd": null,
      "date": "Thu, 21 Aug 2025 07:00:00 GMT",
      "investors": [],
      "source_url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE44QVFGVnZrdDl5d2RMTnZocXQ2Njh6ZW1LR0hsZnpzVDFYRkNNZGExQXBBMTNwQXpZdi1YZHNPcnc3dWxIazB5d185N3UwVnMyUnU0RDRR?oc=5",
      "headline": "Notion Statistics 2026: Funding, Usage, and Competitive Edge - SQ Magazine"
    }
  ],
  "press_releases": [
    {
      "company_name": "Notion",
      "title": "Notion rides AI boom to $500 million in annual revenue, but Microsoft competition looms - CNBC",
      "content": "Notion rides AI boom to $500 million in annual revenue, but Microsoft competition looms CNBC",
      "published_date": "Thu, 18 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNSnhWa0cwMHlLMzRLMFBZdWVCTnE4dDJsTTV3WjZXVkhkRFhmTGpYdXMwWWF1dThvaVRzWDMtaUxHRVFVLUkwSV8tZHlqRk0wNkdUVjRBM0h6emo1Nm5HV1l6SWhTcWJ0blRsZkNKd3o2NmpLcFFVMVBsaDlnaXV0b2M4MEhQWktfbzJSTmJJRndPNUJ0SVgyMlpfbUU3aVBjM1pIMzI1LVnSAa4BQVVfeXFMT2o1ZDZVaFJLWmU2cTBlZjdXeFNFOWtiMjZ3T014U1RvMzR3cW9PMGRNZ3ZpMXNCWVVfTkN4UXVvdVQ2bjZxVGY0RTFaZEhPdWJwWkpVNG1sUHJDaTNJVE93TGJDZWpkRm45OVQtVzEteUVmRXpXZUt2QjYteXRZYy1uMUVVMlRsdFE4NVRzS3RfUkRMWWdXZWxUQmttbW5Mb1B2NGdXSk5BaG00VDNR?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion’s new AI Agents will basically do your job for you - The Verge",
      "content": "Notion’s new AI Agents will basically do your job for you The Verge",
      "published_date": "Thu, 18 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1KRko4RXlVR1B3TzVMVUYyeWJtVnNKWFVVWHJaNDkwSjBXZTRjVVlwRDhYTWVWckI5OU1aMGkzX0c5aEV4T0RVNExZTWpTLTluVHVmUjR6LTNVQ3hYdmlPYmtSblE0eFFFTmcybFNzemJaQQ?oc=5",
      "pivot_signals": [
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "Notion’s new AI agents can research, write, and run your team’s workflows - Fast Company",
      "content": "Notion’s new AI agents can research, write, and run your team’s workflows Fast Company",
      "published_date": "Thu, 18 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPcTlhR0cyZk9hMWZZSEZmNUtZN0thZEhlZWh5NWFFRWRfMlBSdm9hWi1WYkl6c1FZRTI2SzlydnlzUTVxT1d2ZGVHa1VGYUZmc1VWUEtqVHFCMWg0MEFNUmY0LW9FaGh5bXpkZWxwZnlLNjVMc0tjMjZyQ251QUxCSWE1RQ?oc=5",
      "pivot_signals": [
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "Notion launches agents for data analysis and task automation - TechCrunch",
      "content": "Notion launches agents for data analysis and task automation TechCrunch",
      "published_date": "Thu, 18 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNQ2xHMXNCYU5rU0x0VDlFTFQwMWZObm1Qa0t5SVpJYjVnbHhVM2ktazJBZExwb2pqNERIcVRpSmhjYWREcEh1Yk5QU2xwV0FDQVFyaUlTRzhCNnBhQ19MNmlRM1FPc2VuVnFXQ3Eyd1loRWFscTRwaE04MDh3eXdoNWViN2xxcGNhVURUVzVobEx1YWVDYVVUamd2Yw?oc=5",
      "pivot_signals": [
        "launch",
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "Notion brings its AI-powered email app to the iPhone - 9to5Mac",
      "content": "Notion brings its AI-powered email app to the iPhone 9to5Mac",
      "published_date": "Mon, 18 Aug 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFAteWZGdVM3QzZrZ01tT0Nseno2NnZtX1B1LUY5YThGb1o0MWFQTjNRSERoWVBkTlpnVGVITjFFZ3lBSTJ3NDR1aDU1Y0lpOGtaVHB3UGJPZzNRZ0l5S2Vn?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion’s rebuild for agentic AI: How GPT‑5 helped unlock autonomous workflows - OpenAI",
      "content": "Notion’s rebuild for agentic AI: How GPT‑5 helped unlock autonomous workflows OpenAI",
      "published_date": "Fri, 07 Nov 2025 08:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMiR0FVX3lxTE9LV2N6Qk4wRzNRQlRCQ1RuaGx5VEpNWWpXR1o5ejBXekNVcEVWdjJReVlEV0EzV3YzelFEN1Q4UkgtR1NocDFz?oc=5",
      "pivot_signals": [
        "agentic",
        "agent",
        "rebuild"
      ]
    },
    {
      "company_name": "Notion",
      "title": "Notion 3.0 Arrives With AI Agents - Thurrott.com",
      "content": "Notion 3.0 Arrives With AI Agents Thurrott.com",
      "published_date": "Fri, 19 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1xcTMzRjV3T0l5MlNBaEp2QnpOcTZvSlpLLTNGaUZHNWN4T04xNjFXQTc1bGRBOGREcXl0UGp3NzVyLWdmYk5oZE53T1MxNTdjcGFVZVBqOU9sZ2pwWFJEWkhxOERlaU02aGlSTWE5ekxaOEw2UlVCWlNlMA?oc=5",
      "pivot_signals": [
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "To scale agentic AI, Notion tore down its tech stack and started fresh - VentureBeat",
      "content": "To scale agentic AI, Notion tore down its tech stack and started fresh VentureBeat",
      "published_date": "Wed, 08 Oct 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQWm9IQUpwZlVzU3Jfa0xPMjJYTUZrS01qUW0tak83ZVVPODZCanZfTDFGZzZjaUxYTVVsZXNMRXJnVzJaMEdNNTVFQ3Vna2g5WnpVVUFtcnpBQ3hkdDZkM1dTVGNwdmRBTFpQNE5OZlFPeW02aUd6S0FIWEkxUzFhc0VQdUVGY1hGODJRX0V1X2VadE01dFh5M1FzWUk?oc=5",
      "pivot_signals": [
        "agentic",
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "The 10% Rule: How Much Should You Really Invest in Customer Success? With the CRO of Notion and VP of CS at GitHub - SaaStr",
      "content": "The 10% Rule: How Much Should You Really Invest in Customer Success? With the CRO of Notion and VP of CS at GitHub SaaStr",
      "published_date": "Sun, 24 Aug 2025 22:42:15 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPY3ZVYkNWZnpQOWlkenlrUElwNFpZTTdjZTJJQ0xTaTduamNheTVELU5mNkNCNjRfZnpsZlNQOWFkb1hwM1JzMjAzQVFxeDFNZE9CRE9BeHl2VmF2eEtiSmFXSGRGd1RPeDRZdjFQeWloNHEzXy1fT2dFbVRHNXFkSVhFZlVVTVo0SW00V05xODZ5cVhRUEVVNGlSWURRMGZsb3hCTjBQZTM1c0RnbHRLYW1KTkJEM29Nd3daRWVwUzl0bnhVa2NqUkdTT0JhaW8y?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion’s 3.0 Update Wants to Help You With Project Management - How-To Geek",
      "content": "Notion’s 3.0 Update Wants to Help You With Project Management How-To Geek",
      "published_date": "Fri, 19 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5mQV9fdzVDalFaRnFzV05rcU5KVU9MODVsZWstaldMaF82SVZXYjRlWTZ1REpHZ2Nzb0l0QmJJMmxlZVlrUFRnc2JoNTRrQWJJS29sbXBBOHBQZjlZekZER0UyTGtlQlhsZlp5NldjODlGYXRk?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion 3.0 launches AI agents — and I think personal workspaces are next - Tom's Guide",
      "content": "Notion 3.0 launches AI agents — and I think personal workspaces are next Tom's Guide",
      "published_date": "Mon, 22 Sep 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNbDl5dFZtbURWXzZkdFNNYzFlZS1TZUpjS1BwMzNBT2d6a25paUEzWU1Xc3ZQQWgzQUx3NkxtLVZBWTJrSGJuYTlsbENPWVFZUzlkeDVXZ21TQzNMMU9SVjdqU0NTSGpGalpTVzA3dlRCNENRVnhQQWFRQ1k3MlpTN2o2MFdyZGZVWGUwV1RNam1PUEtyMnVCZHlXZVNNN2hVdFlsWFhaR0JKWHRrOFJuYmhjZ3RLa29xQlZ5Z3BMVlU3QQ?oc=5",
      "pivot_signals": [
        "launch",
        "agent"
      ]
    },
    {
      "company_name": "Notion",
      "title": "Notion Mail offers AI perks - but skips a few crucial Notion features - ZDNET",
      "content": "Notion Mail offers AI perks - but skips a few crucial Notion features ZDNET",
      "published_date": "Tue, 15 Apr 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSmhKZFhtbjgtZzkwNk1DU1RTTTI4eUpjdkwxdjNWRVJxMVNHOF9Qd09teGJKSjBJdDlmbFF0SkpBSDFvOG00UjMyT2ZVWmZrNHdwbHdDeVVOcTVJZmtOLWJYb0FtZ2dLQ21kbmJPUEVEd1pHeVR4Yzk5SEpoV2JaaGE0X1U5UHJGZTZlWTUxQnVNRGN5OTM0R2hweEJYN28?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion-like Markdown Note-Taking App 'Obsidian' is Out of Beta - It's FOSS",
      "content": "Notion-like Markdown Note-Taking App 'Obsidian' is Out of Beta It's FOSS",
      "published_date": "Sun, 09 Nov 2025 13:23:23 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE9idURqNjh6MHJkbC1RUmhMdkhlcmlDWGpGZjM5cjlfb1o4M09xR1RaSlRuZVRhQ0VweW90a0VWUzI1M3ZUYXdGV08yRDZuaWxBNHNZVWlQNA?oc=5",
      "pivot_signals": []
    },
    {
      "company_name": "Notion",
      "title": "Notion’s new Feed View is the perfect layout for short-form content addicts like me - XDA",
      "content": "Notion’s new Feed View is the perfect layout for short-form content addicts like me XDA",
      "published_date": "Fri, 27 Jun 2025 07:00:00 GMT",
      "source_url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZ3BRSXNTcVJLOEtudHBKN1VVT0pCdk9WdUJGbG90U3F5dFFocldKSzJfLWVqMkJOT0RpTHhTUVZQalBGbG1TbGZ4cXVUQzluUGJhcnFKdjYxZVRRNk93YVQ4NExNMU1yczlCREpjLUxCRXNFMmNmR2VDaTB4OTNoT3ZMRjRxSk5taDF4MXMwRF9mZngtYk5sbWVn?oc=5",
      "pivot_signals": []
    }
  ],
  "fiscal_pressure": {
    "fiscal_pressure_score": 0,
    "fiscal_pressure_label": "Minimal",
    "signals": [
      "Recent funding: Notion at $11 Billion: The Art of Growing Into Your Valuatio"
    ]
  },
  "technical_debt": {
    "score": 2,
    "label": "Low",
    "signals": [
      "Modernisation hiring: ['pipeline', 'migration']"
    ]
  },
  "recent_pivot": {
    "score": 8,
    "label": "Critical",
    "signals": [
      "Press signals: ['launch', 'rebuild', 'agent', 'agentic']",
      "Hiring pivot: ['SaaS', 'vector database', 'data platform', 'AI', 'RAG']"
    ]
  },
  "opportunity_score": 3.85,
  "llm_ready_summary": {
    "company_name": "Notion",
    "fiscal_pressure_score": 0,
    "fiscal_signals": [
      "Recent funding: Notion at $11 Billion: The Art of Growing Into Your Valuatio"
    ],
    "technical_debt_score": 2,
    "debt_signals": [
      "Modernisation hiring: ['pipeline', 'migration']"
    ],
    "recent_pivot": [
      "Press signals: ['launch', 'rebuild', 'agent', 'agentic']",
      "Hiring pivot: ['SaaS', 'vector database', 'data platform', 'AI', 'RAG']"
    ],
    "pivot_score": 8,
    "funding_status": "Notion at $11 Billion: The Art of Growing Into Your Valuation — And After 14 Years, Into One Of The ",
    "trigger_signals": [
      "Notion’s new AI Agents will basically do your job for you - The Verge",
      "Notion’s new AI agents can research, write, and run your team’s workflows - Fast Company",
      "Notion launches agents for data analysis and task automation - TechCrunch",
      "Notion’s rebuild for agentic AI: How GPT‑5 helped unlock autonomous workflows - OpenAI",
      "Notion 3.0 Arrives With AI Agents - Thurrott.com"
    ],
    "revenue_trend": "private",
    "trigger_recency_days": 30,
    "total_jobs_posted": 30,
    "top_hiring_dept": [
      "Sales",
      "Engineering",
      "Marketing"
    ],
    "pivot_hiring_keywords": [
      "SaaS",
      "vector database",
      "data platform",
      "AI",
      "RAG"
    ],
    "github_debt_score": 1,
    "opportunity_score": 3.85
  }
}